/*
SQLyog Ultimate v12.09 (64 bit)
MySQL - 5.7.12-log : Database - web_book
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`web_book` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `web_book`;

/*Table structure for table `about` */

DROP TABLE IF EXISTS `about`;

CREATE TABLE `about` (
  `software` varchar(100) NOT NULL,
  `banquan` varchar(100) NOT NULL,
  `address` varchar(200) DEFAULT NULL,
  `linkman` varchar(40) NOT NULL,
  `linkphone` varchar(40) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `about` */

insert  into `about`(`software`,`banquan`,`address`,`linkman`,`linkphone`) values ('宇丰咨询客户信息管理系统','广州宇丰工程咨询有限公司','广州市天河区粤垦路4、8号二楼东面2D号','周修丰','020—36659000');

/*Table structure for table `company` */

DROP TABLE IF EXISTS `company`;

CREATE TABLE `company` (
  `id` varchar(40) NOT NULL,
  `companyname` varchar(100) NOT NULL,
  `linkman` varchar(20) NOT NULL,
  `linkphone` varchar(20) NOT NULL,
  `address` varchar(200) DEFAULT NULL,
  PRIMARY KEY (`id`,`companyname`),
  UNIQUE KEY `companyname` (`companyname`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `company` */

insert  into `company`(`id`,`companyname`,`linkman`,`linkphone`,`address`) values ('44f49b5a-eb8e-44ee-a486-0f82b5fa1740','中国邮政速递物流股份有限公司广东省电商物流分公司','杨俊豪','13821907906','广州市白云区槎头西洲北路93号\r'),('44f49b5a-eb8e-44ee-a486-0f82b5fa1742','广州市道路扩建工程办公室','林志明','020-87560912','广州越秀区仓边路133号\r'),('44f49b5a-eb8e-44ee-a486-0f82b5fa1744','中国移动通信集团公司广东分公司','王明辉','13843256709','广州天河区天河北路610号金海大厦\r'),('44f49b5a-eb8e-44ee-a486-0f82b5fa1744','汕头市潮阳区城市综合管理局','张静丽','13256789078','广东省汕头市峡山街道峡山广汕公路南1009号\r'),('44f49b5a-eb8e-44ee-a486-0f82b5fa1745','中国移动通信集团广东有限公司河源分公司','廖文琴','13532167567','河源市新市区建设大道移动综合大楼\r'),('44f49b5a-eb8e-44ee-a486-0f82b5fa1746','中国移动通信集团广东有限公司东莞分公司','章伟','13577890899','东莞市东城街道东城大道升威楼二楼\r'),('44f49b5a-eb8e-44ee-a486-0f82b5fa1747','中移铁通有限公司广东分公司','余冰','020-86546890','广州市越秀区中山一路163号\r'),('44f49b5a-eb8e-44ee-a486-0f82b5fa1748','中国移动通信集团广东有限公司中山分公司','黎晓君','13521131678','广东省中山市东区起湾南道139号\r'),('44f49b5a-eb8e-44ee-a486-0f82b5fa1749','中国移动通信集团广东有限公司深圳分公司','张铭华','13867112345','深圳市福田区莲花街道深南大道2010号中国移动深圳信息大厦\r'),('44f49b5a-eb8e-44ee-a486-0f82b5fa1751','广东省卫生和计划生育委员会','李玲玲','13571223890','广州市越秀区先烈南路17号大院省\r'),('44f49b5a-eb8e-44ee-a486-0f82b5fa1752','惠州白鹭湖旅游实业开发有限公司','吴天华','13844513890','广东省惠州市汝湖镇东亚角洞水库\r');

/*Table structure for table `contract` */

DROP TABLE IF EXISTS `contract`;

CREATE TABLE `contract` (
  `id` varchar(40) NOT NULL,
  `contracttime` varchar(10) NOT NULL,
  `contractname` varchar(200) NOT NULL,
  `invoicetitle` varchar(100) NOT NULL,
  `address` varchar(200) NOT NULL,
  `contractcontent` varchar(50) NOT NULL,
  `invoicedetail` varchar(20) NOT NULL,
  `invoicetime` varchar(20) NOT NULL,
  `invoicenumber` varchar(100) NOT NULL,
  `invoiceamount` varchar(50) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `contract` */

insert  into `contract`(`id`,`contracttime`,`contractname`,`invoicetitle`,`address`,`contractcontent`,`invoicedetail`,`invoicetime`,`invoicenumber`,`invoiceamount`) values ('dbed40b8-1394-47e4-9785-bb39a779e701','2015年','广州市道路扩建工程办公室工程造价咨询费项目','广州市道路扩建工程办公室','【造】字2015015224号','工程造价咨询','咨询费','2015/12/16','28617713','23,030.130 \r'),('dbed40b8-1394-47e4-9785-bb39a779e702','2015年','广州市道路扩建工程办公室工程造价咨询费项目','广州市道路扩建工程办公室','【造】字2015015224号','工程造价咨询','咨询费','2015/12/10','23676950','9,987.470 \r'),('dbed40b8-1394-47e4-9785-bb39a779e703','2015年','河源移动2015-2016年工程造价审计服务项目','中国移动通信集团广东有限公司河源分公司','【造】字2015015228号','工程造价审核','咨询费','2016/6/16','58893985','800.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e704','2015年','河源移动2015-2016年工程造价审计服务项目','中国移动通信集团广东有限公司河源分公司','【造】字2015015228号','工程造价审核','咨询费','2016/6/16','58893984','800.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e705','2015年','河源移动2015-2016年工程造价审计服务项目','中国移动通信集团广东有限公司河源分公司','【造】字2015015228号','工程造价审核','咨询费','2016/6/16','58893983','1,600.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e706','2015年','河源移动2015-2016年工程造价审计服务项目','中国移动通信集团广东有限公司河源分公司','【造】字2015015228号','工程造价审核','咨询费','2016/4/20','25241517','1,600.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e707','2015年','中国移动通信集团广东分公司2015-2017年度工程造价审核框架协议（佛山）','中国移动通信集团公司广东分公司','【造】字2015015220号','预（结）算审核','咨询费','2015/12/15','18853661','4,571.480 \r'),('dbed40b8-1394-47e4-9785-bb39a779e708','2015年','中国移动通信集团广东分公司2015-2017年度工程造价审核框架协议（佛山）','中国移动通信集团公司广东分公司','【造】字2015015220号','预（结）算审核','咨询费','2015/10/8','08028412','8,051.830 \r'),('dbed40b8-1394-47e4-9785-bb39a779e709','2015年','中国移动通信集团广东分公司2015-2017年度工程造价审核框架协议（佛山）','中国移动通信集团公司广东分公司','【造】字2015015220号','预（结）算审核','咨询费','2015/9/28','08028416','5,600.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e710','2015年','中国移动通信集团广东分公司2015-2017年度工程造价审核框架协议（佛山）','中国移动通信集团公司广东分公司','【造】字2015015220号','预（结）算审核','咨询费','2015/7/8','03336200','14,474.170 \r'),('dbed40b8-1394-47e4-9785-bb39a779e711','2015年','中国移动通信集团广东分公司2015-2017年度工程造价审核框架协议（佛山）','中国移动通信集团公司广东分公司','广州市越秀区东华西路59号移动大厦8楼','工程造价审核','咨询费','2016/5/26','76831132','546.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e712','2015年','中国移动通信集团广东分公司2015-2017年度工程造价审核框架协议（佛山）','中国移动通信集团公司广东分公司','广州市越秀区东华西路59号移动大厦8楼','工程造价审核','咨询费','2016/5/26','76831131','6,413.650 \r'),('dbed40b8-1394-47e4-9785-bb39a779e713','2015年','中国移动通信集团广东分公司2015-2017年度工程造价审核框架协议（佛山）','中国移动通信集团公司广东分公司','广州市越秀区东华西路59号移动大厦8楼','工程造价审核','咨询费','2016/5/26','58893978','32,446.630 \r'),('dbed40b8-1394-47e4-9785-bb39a779e714','2015年','中国移动通信集团广东分公司2015-2017年度工程造价审核框架协议（佛山）','中国移动通信集团公司广东分公司','广州市越秀区东华西路59号移动大厦8楼','工程造价审核','咨询费','2016/4/28','25241522','3,600.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e715','2015年','中国移动通信集团广东分公司2015-2017年度工程造价审核框架协议（佛山）','中国移动通信集团公司广东分公司','广州市越秀区东华西路59号移动大厦8楼','工程造价审核','咨询费','2016/4/28','42246658','520.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e716','2015年','中国移动通信集团广东分公司2015-2017年度工程造价审核框架协议（佛山）','中国移动通信集团公司广东分公司','广州市越秀区东华西路59号移动大厦8楼','工程造价审核','咨询费','2016/4/28','25241518','2,721.720 \r'),('dbed40b8-1394-47e4-9785-bb39a779e717','2015年','中国移动广东公司湛江分公司2015年工程造价审核业务服务合同','中国移动通信集团广东有限公司湛江分公司','湛江市人民大道北60号','工程造价审核','咨询费','2016/4/28','25241523','67,618.570 \r'),('dbed40b8-1394-47e4-9785-bb39a779e718','2015年','中国移动广东公司湛江分公司2015年工程造价审核业务服务合同','中国移动通信集团广东有限公司湛江分公司','湛江市人民大道北60号','工程造价审核','咨询费','2016/4/28','25241524','6,481.250 \r'),('dbed40b8-1394-47e4-9785-bb39a779e719','2015年','中国铁通集团有限公司广东分公司2015-2017年度工程造价审核框架协议','中移铁通有限公司广东分公司','广州市越秀区中山一路163号','工程造价审核','咨询费','2016/3/25','25241512','330.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e720','2015年','中国铁通集团有限公司广东分公司2015-2017年度工程造价审核框架协议','中移铁通有限公司广东分公司','广州市越秀区中山一路163号','工程造价审核','咨询费','2016/4/18','25241513','800.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e721','2015年','中山移动2015-2016年建设项目造价审计服务项目','中国移动通信集团广东有限公司中山分公司','广东省中山市东区起湾南道139号','工程造价审核','咨询费','2016/1/7','18853665','4,800.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e722','2015年','中山移动2015-2016年建设项目造价审计服务项目','中国移动通信集团广东有限公司中山分公司','广东省中山市东区起湾南道139号','工程造价审核','咨询费','2016/1/7','18853663','91,099.910 \r'),('dbed40b8-1394-47e4-9785-bb39a779e723','2015年','中山移动2015-2016年建设项目造价审计服务项目','中国移动通信集团广东有限公司中山分公司','广东省中山市东区起湾南道139号','工程造价审核','咨询费','2016/4/18','25241514','35,388.190 \r'),('dbed40b8-1394-47e4-9785-bb39a779e724','2015年','中山移动2015-2016年建设项目造价审计服务项目','中国移动通信集团广东有限公司中山分公司','广东省中山市东区起湾南道139号','工程造价审核','咨询费','2016/4/18','25241515','7,085.440 \r'),('dbed40b8-1394-47e4-9785-bb39a779e725','2015年','中国移动通信集团广东分公司2015-2017年度工程造价审核框架协议（佛山）','中国移动通信集团公司广东分公司','广州市越秀区东华西路59号移动大厦8楼','工程造价审核','咨询费','2016/5/4','25241525','1,330.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e726','2015年','中国移动通信集团广东分公司2015-2017年度工程造价审核框架协议（佛山）','中国移动通信集团公司广东分公司','广州市越秀区东华西路59号移动大厦8楼','工程造价审核','咨询费','2016/3/16','25241504','5,448.250 \r'),('dbed40b8-1394-47e4-9785-bb39a779e727','2015年','中国移动通信集团广东分公司2015-2017年度工程造价审核框架协议（佛山）','中国移动通信集团公司广东分公司','广州市越秀区东华西路59号移动大厦8楼','工程造价审核','咨询费','2016/3/16','42246641','2,238.500 \r'),('dbed40b8-1394-47e4-9785-bb39a779e728','2015年','中国移动通信集团广东分公司2015-2017年度工程造价审核框架协议（佛山）','中国移动通信集团公司广东分公司','广州市越秀区东华西路59号移动大厦8楼','工程造价审核','咨询费','2016/3/16','25241502','5,310.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e729','2015年','中国移动通信集团广东分公司2015-2017年度工程造价审核框架协议（佛山）','中国移动通信集团公司广东分公司','广州市越秀区东华西路59号移动大厦8楼','工程造价审核','咨询费','2016/3/16','42246639','2,735.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e730','2015年','中国移动通信集团广东分公司2015-2017年度工程造价审核框架协议（佛山）','中国移动通信集团公司广东分公司','广州市越秀区东华西路59号移动大厦8楼','工程造价审核','咨询费','2016/3/16','25241501','6,253.790 \r'),('dbed40b8-1394-47e4-9785-bb39a779e731','2015/12/31','东莞移动2016-2017年内审部工程造价审计项目（成本、投资、TD）','中国移动通信集团广东有限公司东莞分公司','东莞市附城区东城大道升威楼二楼','工程造价审核','咨询费','2016/5/26','76831129','4,851.670 \r'),('dbed40b8-1394-47e4-9785-bb39a779e732','2015/12/31','东莞移动2016-2017年内审部工程造价审计项目（成本、投资、TD）','中国移动通信集团广东有限公司东莞分公司','东莞市附城区东城大道升威楼二楼','工程造价审核','咨询费','2016/5/26','58893979','56,189.050 \r'),('dbed40b8-1394-47e4-9785-bb39a779e733','2015/12/31','东莞移动2016-2017年内审部工程造价审计项目（成本、投资、TD）','中国移动通信集团广东有限公司东莞分公司','东莞市附城区东城大道升威楼二楼','工程造价审核','咨询费','2016/5/26','58893981','11,719.080 \r'),('dbed40b8-1394-47e4-9785-bb39a779e734','2015/12/31','东莞移动2016-2017年内审部工程造价审计项目（成本、投资、TD）','中国移动通信集团广东有限公司东莞分公司','东莞市附城区东城大道升威楼二楼','工程造价审核','咨询费','2016/3/16','25241503','60,353.510 \r'),('dbed40b8-1394-47e4-9785-bb39a779e735','2015/12/31','东莞移动2016-2017年内审部工程造价审计项目（成本、投资、TD）','中国移动通信集团广东有限公司东莞分公司','东莞市附城区东城大道升威楼二楼','工程造价审核','咨询费','2016/3/16','42246640','18,283.830 \r'),('dbed40b8-1394-47e4-9785-bb39a779e736','2015/12/31','东莞移动2016-2017年内审部工程造价审计项目（成本、投资、TD）','中国移动通信集团广东有限公司东莞分公司','东莞市附城区东城大道升威楼二楼','工程造价审核','咨询费','2016/3/16','25241505','5,785.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e737','2015/12/31','东莞移动2016-2017年内审部工程造价审计项目（成本、投资、TD）','中国移动通信集团广东有限公司东莞分公司','东莞市附城区东城大道升威楼二楼','工程造价审核','咨询费','2016/1/27','19600656','25,500.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e738','2015/12/31','东莞移动2016-2017年内审部工程造价审计项目（成本、投资、TD）','中国移动通信集团广东有限公司东莞分公司','东莞市附城区东城大道升威楼二楼','工程造价审核','咨询费','2016/1/27','28617724','2,735.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e739','2015/12/31','东莞移动2016-2017年内审部工程造价审计项目（成本、投资、TD）','中国移动通信集团广东有限公司东莞分公司','东莞市附城区东城大道升威楼二楼','工程造价审核','咨询费','2016/1/27','19600655','3,000.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e740','2015/12/31','东莞移动2016-2017年内审部工程造价审计项目（成本、投资、TD）','中国移动通信集团广东有限公司东莞分公司','东莞市附城区东城大道升威楼二楼','工程造价审核','咨询费','2016/1/27','19600654','18,661.400 \r'),('dbed40b8-1394-47e4-9785-bb39a779e741','2015/12/31','东莞移动2016-2017年内审部工程造价审计项目（成本、投资、TD）','中国移动通信集团广东有限公司东莞分公司','东莞市附城区东城大道升威楼二楼','工程造价审核','咨询费','2016/1/27','28617725','2,775.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e742','2015/12/31','东莞移动2016-2017年内审部工程造价审计项目（成本、投资、TD）','中国移动通信集团广东有限公司东莞分公司','东莞市附城区东城大道升威楼二楼','工程造价审核','咨询费','2016/1/27','19600657','5,110.630 \r'),('dbed40b8-1394-47e4-9785-bb39a779e743','2015/12/31','中国移动广东公司深圳分公司2016-2017年工程造价审计技术服务项目','中国移动通信集团广东有限公司深圳分公司','深圳市福田区福田街道深南大道2010号中国移动深圳信息大厦','工程造价审核','咨询费','2016/3/17','25241506','40,000.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e744','2015/12/31','中国移动广东公司深圳分公司2016-2017年工程造价审计技术服务项目','中国移动通信集团广东有限公司深圳分公司','深圳市福田区福田街道深南大道2010号中国移动深圳信息大厦','工程造价审核','咨询费','2016/3/16','25241500','20,730.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e745','2015/12/31','中国移动广东公司深圳分公司2016-2017年工程造价审计技术服务项目','中国移动通信集团广东有限公司深圳分公司','深圳市福田区福田街道深南大道2010号中国移动深圳信息大厦','工程造价审核','咨询费','2016/3/16','25241499','16,610.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e746','2016/5/30','汕头市潮阳区西关路、公园路、河西路、河西街、亭脚路道路改造工程','汕头市潮阳区城市综合管理局','汕头市潮阳区城市综合管理局','预算编制','咨询费','2016/6/16','26143850','35,191.710 \r'),('dbed40b8-1394-47e4-9785-bb39a779e747','2016/5/30','汕头市潮阳区西关路、公园路、河西路、河西街、亭脚路道路改造工程','汕头市潮阳区城市综合管理局','汕头市潮阳区城市综合管理局','预算编制','咨询费','2016/6/1','76831136、76831137、76831138、76831139','350,039.730 \r'),('dbed40b8-1394-47e4-9785-bb39a779e748','2016/7/1','建设工程造价咨询合同','中国邮政速递物流股份有限公司广东省电商物流分公司','中国邮政速递物流股份有限公司广东省电商物流分公司','预算审核','咨询费','2017/4/17','29323176','2,000.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e749','2016/7/1','建设工程造价咨询合同','中国邮政速递物流股份有限公司广东省电商物流分公司','中国邮政速递物流股份有限公司广东省电商物流分公司','预算审核','咨询费','2017/4/17','29323174','8,560.260 \r'),('dbed40b8-1394-47e4-9785-bb39a779e750','2016/7/1','建设工程造价咨询合同','中国邮政速递物流股份有限公司广东省电商物流分公司','中国邮政速递物流股份有限公司广东省电商物流分公司','预算审核','咨询费','2017/4/17','29323175','39,395.130 \r'),('dbed40b8-1394-47e4-9785-bb39a779e751','2016年8月','建设工程造价咨询协议','广东省卫生和计划生育委员会','广东省卫生和计划生育委员会','预结算审核','咨询费','2017/12/13','08426511','1,787.280 \r'),('dbed40b8-1394-47e4-9785-bb39a779e752','2016年8月','建设工程造价咨询协议','广东省卫生和计划生育委员会','广东省卫生和计划生育委员会','预结算审核','咨询费','2017/11/9','37391067','1,200.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e753','2016/9/26','粤东区域土建及安装预结算外委工程（惠阳项目）','惠州市惠阳雅居乐房地产开发有限公司','惠州市惠阳雅居乐房地产开发有限公司','工程预/结算造价咨询编制及审核业务','咨询费','2017/12/4','03667476、03667477、03667478','230,641.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e754','2016/9/27','粤东区域结算外委工程（花都项目）','广州花都雅居乐房地产开发有限公司','广州花都雅居乐房地产开发有限公司','工程预/结算造价咨询编制及审核业务','咨询费','2017/12/6','03667487','92,625.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e755','2016/9/27','粤东区域土建及安装预结算外委工程（从化沙贝项目）','广州从化雅居乐房地产开发有限公司','广州从化雅居乐房地产开发有限公司','工程预/结算造价咨询编制及审核业务','咨询费','2017/12/4','03667473','85,710.840 \r'),('dbed40b8-1394-47e4-9785-bb39a779e756','2016/9/27','深圳公司土建预结算外委工程（河源项目）','河源市雅居乐房地产开发有限公司','河源市雅居乐房地产开发有限公司','工程预/结算造价咨询编制及审核业务','咨询费','2017/12/4','03667475','24,391.740 \r'),('dbed40b8-1394-47e4-9785-bb39a779e757','2016/9/30','粤东区域土建及安装预算外委工程（惠州项目）','惠州白鹭湖旅游实业开发有限公司','惠州白鹭湖旅游实业开发有限公司','工程预/结算造价咨询编制及审核业务','咨询费','2017/12/4','03667474','39,193.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e758','2016/9/30','粤东区域土建及安装预算外委工程（惠州项目）','惠州白鹭湖旅游实业开发有限公司','惠州白鹭湖旅游实业开发有限公司','工程预/结算造价咨询编制及审核业务','咨询费','2017/8/14','28495967','36,417.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e759','2016/11/3','广州市政府采购合同','广州市道路扩建工程办公室','广州市道路扩建工程办公室','工程概预结算编制和评审','咨询费','2017/12/13','08426510','24,893.610 \r'),('dbed40b8-1394-47e4-9785-bb39a779e760','2016/11/3','广州市政府采购合同','广州市道路扩建工程办公室','广州市道路扩建工程办公室','工程概预结算编制和评审','咨询费','2017/10/26','21814038','22,322.650 \r'),('dbed40b8-1394-47e4-9785-bb39a779e761','2016/11/3','广州市政府采购合同','广州市道路扩建工程办公室','广州市道路扩建工程办公室','工程概预结算编制和评审','咨询费','2017/8/14','42515369','14,777.750 \r'),('dbed40b8-1394-47e4-9785-bb39a779e762','2016/11/7','关于[2016-2017年度广东电信工程结算审计业务服务集中采购（标段三）]审计业务约定书（宇丰）','中国电信股份有限公司广东分公司','中国电信股份有限公司广东分公司','结算审计','咨询费','2017/11/28','03667466','99,321.500 \r'),('dbed40b8-1394-47e4-9785-bb39a779e763','2016/11/7','关于[2016-2017年度广东电信工程结算审计业务服务集中采购（标段三）]审计业务约定书（宇丰）','中国电信股份有限公司广东分公司','中国电信股份有限公司广东分公司','结算审计','咨询费','2017/8/22','28495971','1,000.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e764','2016/12/2','惠州分公司2016-2018年工程造价审核服务公开招标项目合同（广州宇丰工程咨询有限公司）','中国移动通信集团广东有限公司惠州分公司','中国移动通信集团广东有限公司惠州分公司','工程造价审核','咨询费','2017/10/31','08829542','1,641.300 \r'),('dbed40b8-1394-47e4-9785-bb39a779e765','2016/12/2','惠州分公司2016-2018年工程造价审核服务公开招标项目合同（广州宇丰工程咨询有限公司）','中国移动通信集团广东有限公司惠州分公司','中国移动通信集团广东有限公司惠州分公司','工程造价审核','咨询费','2017/10/31','08829541','80,735.400 \r'),('dbed40b8-1394-47e4-9785-bb39a779e766','2016/12/2','惠州分公司2016-2018年工程造价审核服务公开招标项目合同（广州宇丰工程咨询有限公司）','中国移动通信集团广东有限公司惠州分公司','中国移动通信集团广东有限公司惠州分公司','工程造价审核','咨询费','2017/8/14','28495964','20,216.650 \r'),('dbed40b8-1394-47e4-9785-bb39a779e767','2016/12/2','惠州分公司2016-2018年工程造价审核服务公开招标项目合同（广州宇丰工程咨询有限公司）','中国移动通信集团广东有限公司惠州分公司','中国移动通信集团广东有限公司惠州分公司','工程造价审核','咨询费','2017/8/14','28495965','1,140.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e768','2016/12/8','深圳分公司2016-2018年工程造价审核服务一般框架采购合同','中国移动通信集团广东有限公司深圳分公司','中国移动通信集团广东有限公司深圳分公司','工程造价审核','咨询费','2017/12/12','03667510','360.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e769','2016/12/8','深圳分公司2016-2018年工程造价审核服务一般框架采购合同','中国移动通信集团广东有限公司深圳分公司','中国移动通信集团广东有限公司深圳分公司','工程造价审核','咨询费','2017/9/1','28495972、28495973、28495974','237,314.300 \r'),('dbed40b8-1394-47e4-9785-bb39a779e770','2016/12/8','深圳分公司2016-2018年工程造价审核服务一般框架采购合同','中国移动通信集团广东有限公司深圳分公司','中国移动通信集团广东有限公司深圳分公司','工程造价审核','咨询费','2017/9/1','28495975','24,179.500 \r'),('dbed40b8-1394-47e4-9785-bb39a779e771','2016/12/15','2016-2018年工程造价审核服务框架合同（成本类,广州宇丰）','中国移动通信集团广东有限公司东莞分公司','中国移动通信集团广东有限公司东莞分公司','工程预结算','咨询费','2017/12/6','03667501','52,131.370 \r'),('dbed40b8-1394-47e4-9785-bb39a779e772','2016/12/15','2016-2018年工程造价审核服务框架合同（成本类,广州宇丰）','中国移动通信集团广东有限公司东莞分公司','中国移动通信集团广东有限公司东莞分公司','工程预结算','咨询费','2017/12/6','03667503','2,444.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e773','2016/12/15','2016-2018年工程造价审核服务框架合同（成本类,广州宇丰）','中国移动通信集团广东有限公司东莞分公司','中国移动通信集团广东有限公司东莞分公司','工程预结算','咨询费','2017/12/6','03667502','4,182.800 \r'),('dbed40b8-1394-47e4-9785-bb39a779e774','2016/12/15','2016-2018年工程造价审核服务框架合同（成本类,广州宇丰）','中国移动通信集团广东有限公司东莞分公司','中国移动通信集团广东有限公司东莞分公司','工程预结算','咨询费','2017/10/10','28513471','4,797.330 \r'),('dbed40b8-1394-47e4-9785-bb39a779e775','2016/12/15','2016-2018年工程造价审核服务框架合同（成本类,广州宇丰）','中国移动通信集团广东有限公司东莞分公司','中国移动通信集团广东有限公司东莞分公司','工程预结算','咨询费','2017/10/10','28513472','83,001.370 \r'),('dbed40b8-1394-47e4-9785-bb39a779e776','2016/12/15','2016-2018年工程造价审核服务框架合同（成本类,广州宇丰）','中国移动通信集团广东有限公司东莞分公司','中国移动通信集团广东有限公司东莞分公司','工程预结算','咨询费','2017/9/22','28513451','8,171.200 \r'),('dbed40b8-1394-47e4-9785-bb39a779e777','2016/12/15','2016-2018年工程造价审核服务框架合同（成本类,广州宇丰）','中国移动通信集团广东有限公司东莞分公司','中国移动通信集团广东有限公司东莞分公司','工程预结算','咨询费','2017/9/22','28513452','3,666.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e778','2016/12/15','2016-2018年工程造价审核服务框架合同（成本类,广州宇丰）','中国移动通信集团广东有限公司东莞分公司','中国移动通信集团广东有限公司东莞分公司','工程预结算','咨询费','2017/9/22','28513453、28513454','143,799.440 \r'),('dbed40b8-1394-47e4-9785-bb39a779e779','2016/12/21','中国移动广东公司云浮分公司2016-2018年工程造价审核服务（标段二）框架采购合同(宇丰）上市合同','中国移动通信集团广东有限公司云浮分公司','中国移动通信集团广东有限公司云浮分公司','工程编制，预结算','咨询费','2017/12/5','03667484','650.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e780','2016/12/21','中国移动广东公司云浮分公司2016-2018年工程造价审核服务（标段二）框架采购合同(宇丰）上市合同','中国移动通信集团广东有限公司云浮分公司','中国移动通信集团广东有限公司云浮分公司','工程编制，预结算','咨询费','2017/12/5','03667483','14,310.200 \r'),('dbed40b8-1394-47e4-9785-bb39a779e781','2016/12/21','中国移动广东公司云浮分公司2016-2018年工程造价审核服务（标段二）框架采购合同(宇丰）上市合同','中国移动通信集团广东有限公司云浮分公司','中国移动通信集团广东有限公司云浮分公司','工程编制，预结算','咨询费','2017/10/9','28513462','6,549.810 \r'),('dbed40b8-1394-47e4-9785-bb39a779e782','2016/12/21','中国移动广东公司云浮分公司2016-2018年工程造价审核服务（标段二）框架采购合同(宇丰）上市合同','中国移动通信集团广东有限公司云浮分公司','中国移动通信集团广东有限公司云浮分公司','工程编制，预结算','咨询费','2017/10/9','28513461','21,633.690 \r'),('dbed40b8-1394-47e4-9785-bb39a779e783','2016/12/23','清远分公司2016-2018年工程造价审核服务公开招标项目','中国移动通信集团广东有限公司清远分公司','中国移动通信集团广东有限公司清远分公司','工程预结算审计','咨询费','2017/10/17','08829518','13,378.590 \r'),('dbed40b8-1394-47e4-9785-bb39a779e784','2016/12/23','清远分公司2016-2018年工程造价审核服务公开招标项目','中国移动通信集团广东有限公司清远分公司','中国移动通信集团广东有限公司清远分公司','工程预结算审计','咨询费','2017/10/17','08829517','10,647.300 \r'),('dbed40b8-1394-47e4-9785-bb39a779e785','2016/12/23','清远分公司2016-2018年工程造价审核服务公开招标项目','中国移动通信集团广东有限公司清远分公司','中国移动通信集团广东有限公司清远分公司','工程预结算审计','咨询费','2017/7/31','28479611','12,800.450 \r'),('dbed40b8-1394-47e4-9785-bb39a779e786','2016/12/23','清远分公司2016-2018年工程造价审核服务公开招标项目','中国移动通信集团广东有限公司清远分公司','中国移动通信集团广东有限公司清远分公司','工程预结算审计','咨询费','2017/7/31','28479612','9,621.340 \r'),('dbed40b8-1394-47e4-9785-bb39a779e787','2016/12/29','汕头分公司2016-2018年工程造价审核服务公开招标项目','中国移动通信集团广东有限公司汕头分公司','中国移动通信集团广东有限公司汕头分公司','工程造价审核','咨询费','2017/11/24','03667463-03667464','14,305.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e788','2016/12/29','汕头分公司2016-2018年工程造价审核服务公开招标项目','中国移动通信集团广东有限公司汕头分公司','中国移动通信集团广东有限公司汕头分公司','工程造价审核','咨询费','2017/11/24','03667465','15,400.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e789','2016/12/29','汕头分公司2016-2018年工程造价审核服务公开招标项目','中国移动通信集团广东有限公司汕头分公司','中国移动通信集团广东有限公司汕头分公司','工程造价审核','咨询费','2017/8/2','28479617','960.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e790','2016/12/29','汕头分公司2016-2018年工程造价审核服务公开招标项目','中国移动通信集团广东有限公司汕头分公司','中国移动通信集团广东有限公司汕头分公司','工程造价审核','咨询费','2017/8/2','28479618','2,120.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e791','2016/12/29','汕头分公司2016-2018年工程造价审核服务公开招标项目','中国移动通信集团广东有限公司汕头分公司','中国移动通信集团广东有限公司汕头分公司','工程造价审核','咨询费','2017/8/2','28479620','3,180.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e792','2017年6月','广东省清远市地方税务局办公楼中央空调系统更新改造及装饰修复项目','广东省清远市地方税务局','广东省清远市地方税务局','结算审核','咨询费','2017/11/9','37391068','27,584.910 \r'),('dbed40b8-1394-47e4-9785-bb39a779e793','2017年6月','中山市沙溪理工学校校园文化建设工程','中山市沙溪理工学校','中山市沙溪理工学校','预算编制','咨询费','2017/9/29','28513458','1,500.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e794','2017/6/22','苏州合景峰汇九期北机电总包工程及消防工程造价咨询服务合同','苏州市合景房地产开发有限公司','苏州市合景房地产开发有限公司','造价咨询','咨询费','2017/9/1','42515396','20,561.820 \r'),('dbed40b8-1394-47e4-9785-bb39a779e795','2017/6/22','苏州合景峰汇九期北机电总包工程及消防工程造价咨询服务合同','苏州市合景房地产开发有限公司','苏州市合景房地产开发有限公司','造价咨询','咨询费','2017/9/1','4251595','49,348.350 \r'),('dbed40b8-1394-47e4-9785-bb39a779e796','2017/7/7','影荫路南侧影荫三街北侧道路工程','佛山市禅城区石湾镇街道国土城建和水务局','佛山市禅城区石湾镇街道国土城建和水务局','工程概算、预算编号','咨询费','2017/12/7','08426494','7,350.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e797','2017/7/7','影荫路南侧影荫三街北侧道路工程','佛山市禅城区石湾镇街道国土城建和水务局','佛山市禅城区石湾镇街道国土城建和水务局','工程概算、预算编号','咨询费','2017/12/7','08426495','18,866.970 \r'),('dbed40b8-1394-47e4-9785-bb39a779e798','2017/7/7','影荫路南侧影荫三街北侧道路工程','佛山市禅城区石湾镇街道国土城建和水务局','佛山市禅城区石湾镇街道国土城建和水务局','工程概算、预算编号','咨询费','2017/12/7','08426493','10,520.530 \r'),('dbed40b8-1394-47e4-9785-bb39a779e799','2017/7/7','影荫路南侧影荫三街北侧道路工程','佛山市禅城区石湾镇街道国土城建和水务局','佛山市禅城区石湾镇街道国土城建和水务局','工程概算、预算编号','咨询费','2017/12/7','08426496','4,716.410 \r'),('dbed40b8-1394-47e4-9785-bb39a779e7d1','2015年','广州市道路扩建工程办公室工程造价咨询费项目','广州市道路扩建工程办公室','【造】字2015015224号','工程造价咨询','咨询费','2015/12/16','28617713','23,030.130 \r'),('dbed40b8-1394-47e4-9785-bb39a779e7d2','2015年','中国移动通信集团广东分公司2015-2017年度工程造价审核框架协议（佛山）','中国移动通信集团公司广东分公司','【造】字2015015220号','预（结）算审核','咨询费','2015/12/15','18853661','4,571.480 \r'),('dbed40b8-1394-47e4-9785-bb39a779e7d3','2015年','广州市道路扩建工程办公室工程造价咨询费项目','广州市道路扩建工程办公室','【造】字2015015224号','工程造价咨询','咨询费','2015/12/10','23676950','9,987.470 \r'),('dbed40b8-1394-47e4-9785-bb39a779e7d4','2015年','中国移动通信集团广东分公司2015-2017年度工程造价审核框架协议（佛山）','中国移动通信集团公司广东分公司','【造】字2015015220号','预（结）算审核','咨询费','2015/10/8','08028412','8,051.830 \r'),('dbed40b8-1394-47e4-9785-bb39a779e7d5','2015年','中国移动通信集团广东分公司2015-2017年度工程造价审核框架协议（佛山）','中国移动通信集团公司广东分公司','【造】字2015015220号','预（结）算审核','咨询费','2015/9/28','08028416','5,600.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e7d7','2015年','中国移动通信集团广东分公司2015-2017年度工程造价审核框架协议（佛山）','中国移动通信集团公司广东分公司','【造】字2015015220号','预（结）算审核','咨询费','2015/7/8','03336200','14,474.170 \r'),('dbed40b8-1394-47e4-9785-bb39a779e800','2017/8/4','揭阳产业转移工业园山顶公园工程','揭阳市卅岭创业投资开发有限公司','揭阳市卅岭创业投资开发有限公司','工程预算编制','咨询费','2017/12/7','03667508','3,000.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e801','2017/8/4','揭阳产业转移工业园山顶公园工程','揭阳市卅岭创业投资开发有限公司','揭阳市卅岭创业投资开发有限公司','工程预算编制','咨询费','2017/12/7','03667509','2,000.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e802','2017/8/30','金钟三、四、五、联队宅基地临时低压电线路整改工程','中山市板芙城镇房地产开发公司','中山市板芙城镇房地产开发公司','预算编制','咨询费','2017/12/6','08426489','1,600.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e803','2017/9/29','广东核力大厦五楼装修工程（内容：办公室改造工程）','广东核力工程勘察院','广东核力工程勘察院','结算审核','咨询费','2017/10/17','08829516','3,000.000 \r'),('dbed40b8-1394-47e4-9785-bb39a779e804','2017/10/27','长讯公司2017-2018年工程造价审核服务项目委托合同','长讯通信服务有限公司','长讯通信服务有限公司','预算、结算','咨询费','2017/11/6','08829549','4,817.800 \r'),('dbed40b8-1394-47e4-9785-bb39a779e805','2017/10/27','长讯公司2017-2018年工程造价审核服务项目委托合同','长讯通信服务有限公司','长讯通信服务有限公司','预算、结算','咨询费','2017/6/30','03556101','6,266.290 \r'),('dbed40b8-1394-47e4-9785-bb39a779e806','2017/12/27','广东省南粤交通投资建设有限公司2017年通车项目服务区（停车）物业管理费用预算及招标清单编制咨询服务','广东省南粤交通投资建设有限公司','广东省南粤交通投资建设有限公司','预算及招标清单编制','咨询费','2017/12/21','08426527-08426528','122,208.000 \r');

/*Table structure for table `customers` */

DROP TABLE IF EXISTS `customers`;

CREATE TABLE `customers` (
  `id` varchar(40) NOT NULL,
  `cname` varchar(30) NOT NULL,
  `cpassword` varchar(40) NOT NULL,
  `cgender` varchar(5) DEFAULT NULL,
  `cbirth` varchar(15) DEFAULT NULL,
  `cmajority` varchar(30) DEFAULT NULL,
  `cinterest` varchar(50) DEFAULT NULL,
  `cemail` varchar(25) DEFAULT NULL,
  `cphone` varchar(30) NOT NULL,
  PRIMARY KEY (`cname`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `customers` */

insert  into `customers`(`id`,`cname`,`cpassword`,`cgender`,`cbirth`,`cmajority`,`cinterest`,`cemail`,`cphone`) values ('dbed40b8-1394-46e4-9785-bb39a779e7d1','丽萨','123456','女','1992-01-02','软件工程','足球;台球;其他;','laoliweibo@sina.com','17405570239'),('e0335332-9191-410a-b200-f66f1b90ca6b','光头强','asdfcv','男','1050-09-25','建筑学','羽毛球;篮球;','guantouqiang@flash.com','17568945541'),('a3645348-4627-461b-85ac-a667ec1d4a7b','周杰伦','111111','男','1996-08-01','其他','篮球;足球;拳击;其他;','123456@qq.com','18872626574'),('3c6617bb-b7d7-4749-b3fd-a06bf43d4978','思科','ghj123','女','2001-10-01','建筑学','篮球;足球;游泳;羽毛球;排球;台球;拳击;其他;','9654781235@outlook.con','15250216456'),('8ede264b-562c-4f04-bbe8-5bf2a5308131','李大大','gtygty56','女','1997-12-02','小学教育','足球;台球;其他;','lidadasina@sina.com','13406570209'),('cb8495ee-f797-4d18-8596-0fb766603e07','李忠','123456','女','1965-05-01','文学院','羽毛球;足球;','480725864@qq.com','13406689975'),('8f2e09ef-07d1-40cb-9052-ebffd8ad0ec3','测试','123456','男','','其他','足球;其他;','5129478512@163.com','13405570209'),('39e06647-bda0-4303-aff4-53e9225b0b4f','熊二','520520','男','1001-02-02','其他','羽毛球;篮球;足球;游泳;','456123789@outlook.com','13564867591'),('7474d737-d72b-4d9f-a732-eea28712d686','熊大','250250','男','1000-01-01','其他','羽毛球;篮球;足球;','25025025025@outlook.com','15250250250'),('9596b928-8a3d-44c8-913c-778e2b1f87ea','王','123456','女','1992-02-01','计算机与科学','篮球;台球;其他;','148562397@qq.com','13264867596'),('e671b46e-a5e3-4433-a8ea-9b17fc5607d7','王五','qwerdf','女','1985-02-09','计算机与科学','羽毛球;篮球;足球;游泳;','11283919231@163.com','15864567588'),('d6b24e6c-aef6-412a-98c3-8a62b6f4786e','王大','123456','男','1992-10-15','软件工程','篮球;足球;台球;拳击;其他;','wangda@outlook.com','17405510219'),('15a5d82b-8e0a-4058-bd5b-0bcbb97ba957','王老','148159','男','1992-01-01','软件工程','篮球;足球;游泳;羽毛球;排球;台球;拳击;其他;','5129478512@163.com','13405570209'),('7ec06a97-26ae-4a3e-a2dc-90d31805d320','王老二','123789','男','1200-01-02','电子信息','篮球;游泳;台球;其他;','147895623@qq.com','13422312611'),('d33f1e2f-ecb8-4d19-b4ff-a55cefbe3dfd','王老板','asdfgh','男','1992-05-03','计算机与科学','羽毛球;足球;游泳;','5598949525@163.com','13456899535'),('e81d9a2f-c903-420a-a1ed-f556f82fd16d','王霞可','cf1cf2','女','1992-0102','电子信息','篮球;足球;排球;台球;其他;','148262397@163.com','18405510119'),('0bdb1fb7-4208-466a-8d00-df33f7840cbe','蔡依林','hjkiop1','女','1992-02-06','其他','足球;游泳;台球;','caiyilin@outlook.com','13264237596'),('101d202c-8023-4172-a60a-2eede35d3b7c','蔡雯','123qwe','男','1992-01-02','网络工程','篮球;排球;其他;','148562397@163.com','17405570219'),('8acf52a3-4cd7-4e11-ae43-c0b313154f58','袁媛','sjoiu1','男','1991-07-02','计算机与科学','排球;其他;','578856297@163.com','17405021931'),('a6a57e58-8103-427e-bdc7-af777f443412','阿三','asan520','男','1996-01-02','软件工程','足球;台球;拳击;其他;','1485623297@163.com','13557020956'),('89b6ff1d-b1ee-43d4-8397-a95a67878195','阿斯','qwer1230','男','2007-01-01','计算机与科学','足球;台球;其他;','sda1asdad@163.com','15403570247'),('84ffa587-a1ff-4c69-b90a-d68b0f5f543f','高顿','qwer520qw','男','2005-12-21','历史师范','足球;台球;其他;','987564123@sina.com','15250255621');

/*Table structure for table `custservice` */

DROP TABLE IF EXISTS `custservice`;

CREATE TABLE `custservice` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `customername` varchar(100) NOT NULL,
  `linkman` varchar(20) NOT NULL,
  `linkphone` varchar(20) NOT NULL,
  `servicetype` varchar(200) DEFAULT NULL,
  `servicedate` varchar(200) DEFAULT NULL,
  `estimatedcost` varchar(200) DEFAULT NULL,
  `actualcost` varchar(200) DEFAULT NULL,
  `satisfaction` varchar(200) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

/*Data for the table `custservice` */

insert  into `custservice`(`id`,`customername`,`linkman`,`linkphone`,`servicetype`,`servicedate`,`estimatedcost`,`actualcost`,`satisfaction`) values (1,'广州市道路扩建工程办公室','林志明','020-87560912','上门维护','2018/5/26','5000','4000','满意'),(2,'汕头市潮阳区城市综合管理局','张静丽','13256789078','客户培训','2018/7/19','4000','4200','不满意');

/*Table structure for table `lost` */

DROP TABLE IF EXISTS `lost`;

CREATE TABLE `lost` (
  `id` varchar(40) NOT NULL,
  `joindate` varchar(100) NOT NULL,
  `lossdate` varchar(20) NOT NULL,
  `companyname` varchar(20) NOT NULL,
  `reason` varchar(200) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `lost` */

insert  into `lost`(`id`,`joindate`,`lossdate`,`companyname`,`reason`) values ('110491df-776f-40f1-a423-c767b3f86efc','2015/08/30','2018/06/29','中国移动通信集团广东有限公司河源分公司','已与其他集成商达成新周期的合作规划'),('83ee5472-3299-4eb0-b176-26730bc92e59','2016/12/16','2018/08/20','中移铁通有限公司广东分公司','合同价格未谈妥');

/*Table structure for table `opinion` */

DROP TABLE IF EXISTS `opinion`;

CREATE TABLE `opinion` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `companyname` varchar(100) NOT NULL,
  `linkman` varchar(20) NOT NULL,
  `linkphone` varchar(20) NOT NULL,
  `opiniondetail` varchar(200) DEFAULT NULL,
  `opinionstate` varchar(200) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

/*Data for the table `opinion` */

insert  into `opinion`(`id`,`companyname`,`linkman`,`linkphone`,`opiniondetail`,`opinionstate`) values (1,'广州市道路扩建工程办公室','林志明','020-87560912','对应业务人员处理紧急情况经验欠缺，缺乏效率','未解决'),(2,'汕头市潮阳区城市综合管理局','张静丽','13256789079','发票开具进度缓慢','已解决');

/*Table structure for table `users` */

DROP TABLE IF EXISTS `users`;

CREATE TABLE `users` (
  `id` varchar(40) NOT NULL,
  `username` varchar(20) NOT NULL,
  `password` varchar(30) DEFAULT NULL,
  `email` varchar(40) DEFAULT NULL,
  PRIMARY KEY (`id`,`username`),
  UNIQUE KEY `username` (`username`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `users` */

insert  into `users`(`id`,`username`,`password`,`email`) values ('34f39b5a-eb8e-43ee-a486-0f82b5fa1732','sjppop','124','455@163.com'),('933098ad-3737-423d-9cd7-733cfc6668e8','xfzhang','123456',''),('d8f71490-7029-46a8-9da8-9a937010585e','admin','123456',NULL),('d8f71490-7029-46a8-9da8-9a937060585e','user','123456','');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
